-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/andres/repositories/am.as2/report/stata/output/logs/main.log
  log type:  text
 opened on:  28 Sep 2025, 23:22:15

. 
. // load data
. use "$rawdata/childbirth.dta", clear

. 
. // clean data
. save "$cleandata/childbirth_clean.dta", replace
file C:/Users/andres/repositories/am.as2/report/stata/data/clean/childbirth_clean.dta saved

. 
. label define child_lbl ///
>         0 "No childbirth" ///
>         1 "Childbirth"

. label values child_birth child_lbl

. 
. // question one
. gen edyears_cat = .
(55,874 missing values generated)

. replace edyears_cat = 1 if edyears <= 11 & !missing(edyears)
(23,140 real changes made)

. replace edyears_cat = 2 if edyears == 12 & !missing(edyears)
(14,986 real changes made)

. replace edyears_cat = 3 if edyears >= 13 & edyears <= 15 & !missing(edyears)
(11,565 real changes made)

. replace edyears_cat = 4 if edyears >= 16 & !missing(edyears)
(6,183 real changes made)

. 
. label var edyears_cat "Education Category"

. label define edyears_lbl ///
>         1 "Less than HS" ///
>         2 "HS graduate" ///
>         3 "Some college" ///
>         4 "College degree or more"

. label values edyears_cat edyears_lbl

. 
. graph bar (mean) income, over(edyears_cat)

. graph bar (mean) income, over(edyears_cat) by(male)

. 
. // question two
. sum income, detail

                           Income
-------------------------------------------------------------
      Percentiles      Smallest
 1%         84.5            .65
 5%          455              1
10%     547.1706            1.3       Obs              55,874
25%     705.6735            1.3       Sum of wgt.      55,874

50%     989.5908                      Mean           10984.55
                        Largest       Std. dev.      20284.89
75%        14000         235884
90%        34000         235884       Variance       4.11e+08
95%     48892.07         235884       Skewness       3.986936
99%        90000         235884       Kurtosis       28.89835

. count if income <= 0
  0

. 
. gen log_income = log(income)

. reg log_income edyears age i.male ib0.mstatus ib4.ethnicity i.child_birth, r

Linear regression                               Number of obs     =     55,874
                                                F(10, 55863)      =    3875.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4089
                                                Root MSE          =     1.3368

--------------------------------------------------------------------------------------------
                           |               Robust
                log_income | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                   edyears |    .145754   .0030809    47.31   0.000     .1397155    .1517924
                       age |   .1262801   .0017393    72.61   0.000     .1228711    .1296891
                           |
                      male |
                     Male  |   .5999785   .0115407    51.99   0.000     .5773585    .6225984
                           |
                   mstatus |
                  Married  |   .6188734   .0210868    29.35   0.000     .5775431    .6602037
    Separated or divorced  |   .0766986   .0471873     1.63   0.104    -.0157889     .169186
                  Widowed  |   .0647223   .2689565     0.24   0.810    -.4624343    .5918788
                           |
                 ethnicity |
                    Black  |  -.4285689    .013877   -30.88   0.000     -.455768   -.4013698
                 Hispanic  |  -.0825348     .01473    -5.60   0.000    -.1114057   -.0536639
Mixed Race (Non-Hispanic)  |  -.3744138   .0626635    -5.97   0.000    -.4972347   -.2515929
                           |
               child_birth |
               Childbirth  |  -.0794501   .0197668    -4.02   0.000    -.1181932   -.0407071
                     _cons |   3.015595   .0317777    94.90   0.000      2.95331    3.077879
--------------------------------------------------------------------------------------------

. 
. reg log_income i.edyears_cat##i.male age ib0.mstatus ib4.ethnicity i.child_birth, r

Linear regression                               Number of obs     =     55,874
                                                F(15, 55858)      =    2829.71
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4195
                                                Root MSE          =     1.3249

----------------------------------------------------------------------------------------------
                             |               Robust
                  log_income | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
                 edyears_cat |
                HS graduate  |   .3802328   .0219437    17.33   0.000      .337223    .4232426
               Some college  |   .6488383   .0247519    26.21   0.000     .6003245    .6973521
     College degree or more  |   1.023861   .0408868    25.04   0.000     .9437229       1.104
                             |
                        male |
                       Male  |   .4471893   .0146658    30.49   0.000     .4184443    .4759344
                             |
            edyears_cat#male |
           HS graduate#Male  |   .3835508   .0277757    13.81   0.000     .3291103    .4379914
          Some college#Male  |   .1663513   .0307403     5.41   0.000        .1061    .2266025
College degree or more#Male  |   .2206077   .0454066     4.86   0.000     .1316104    .3096051
                             |
                         age |   .1225435   .0016929    72.39   0.000     .1192254    .1258616
                             |
                     mstatus |
                    Married  |   .6013294   .0208982    28.77   0.000     .5603688    .6422901
      Separated or divorced  |   .0630611    .046842     1.35   0.178    -.0287496    .1548717
                    Widowed  |   .0931669   .2496702     0.37   0.709    -.3961883    .5825222
                             |
                   ethnicity |
                      Black  |  -.4142851    .013787   -30.05   0.000    -.4413078   -.3872625
                   Hispanic  |  -.0732316   .0146047    -5.01   0.000    -.1018569   -.0446062
  Mixed Race (Non-Hispanic)  |  -.3751945    .061924    -6.06   0.000     -.496566    -.253823
                             |
                 child_birth |
                 Childbirth  |  -.0758683   .0195754    -3.88   0.000    -.1142362   -.0375003
                       _cons |    4.47134   .0306789   145.75   0.000     4.411209    4.531471
----------------------------------------------------------------------------------------------

. test 2.edyears_cat#1.male 3.edyears_cat#1.male 4.edyears_cat#1.male

 ( 1)  2.edyears_cat#1.male = 0
 ( 2)  3.edyears_cat#1.male = 0
 ( 3)  4.edyears_cat#1.male = 0

       F(  3, 55858) =   66.60
            Prob > F =    0.0000

. 
. // question three
. xtset pid wave

Panel variable: pid (unbalanced)
 Time variable: wave, 2 to 18, but with gaps
         Delta: 1 unit

. 
. xtreg log_income edyears age i.male ib0.mstatus ib4.ethnicity i.child_birth, re

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3380                                         min =          1
     Between = 0.5546                                         avg =        7.8
     Overall = 0.4084                                         max =         17

                                                Wald chi2(10)     =   34633.21
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                   edyears |   .1509147   .0030581    49.35   0.000     .1449209    .1569085
                       age |   .1272876   .0014948    85.16   0.000      .124358    .1302173
                           |
                      male |
                     Male  |   .5698314   .0167349    34.05   0.000     .5370316    .6026312
                           |
                   mstatus |
                  Married  |   .5107319    .019666    25.97   0.000     .4721873    .5492766
    Separated or divorced  |   .0454112   .0391588     1.16   0.246    -.0313386     .122161
                  Widowed  |   .0855097   .2618702     0.33   0.744    -.4277464    .5987658
                           |
                 ethnicity |
                    Black  |  -.3832821   .0191953   -19.97   0.000    -.4209042   -.3456599
                 Hispanic  |  -.0655308   .0203229    -3.22   0.001    -.1053629   -.0256986
Mixed Race (Non-Hispanic)  |     -.3244     .08128    -3.99   0.000    -.4837059    -.165094
                           |
               child_birth |
               Childbirth  |  -.0598945   .0173605    -3.45   0.001    -.0939204   -.0258686
                     _cons |   2.942328   .0341275    86.22   0.000      2.87544    3.009217
---------------------------+----------------------------------------------------------------
                   sigma_u |   .4411512
                   sigma_e |  1.1765995
                       rho |   .1232516   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------

. estimates store random

. 
. // question four
. xtreg log_income edyears age i.male ib0.mstatus ib4.ethnicity i.child_birth, fe
note: 1.male omitted because of collinearity.
note: 1.ethnicity omitted because of collinearity.
note: 2.ethnicity omitted because of collinearity.
note: 3.ethnicity omitted because of collinearity.

Fixed-effects (within) regression               Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3383                                         min =          1
     Between = 0.4945                                         avg =        7.8
     Overall = 0.3713                                         max =         17

                                                F(6, 48742)       =    4154.09
corr(u_i, Xb) = 0.0706                          Prob > F          =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                   edyears |   .1609736   .0038254    42.08   0.000     .1534758    .1684713
                       age |   .1259277   .0016685    75.47   0.000     .1226575    .1291979
                           |
                      male |
                     Male  |          0  (omitted)
                           |
                   mstatus |
                  Married  |   .4178146   .0222754    18.76   0.000     .3741545    .4614746
    Separated or divorced  |  -.0111624   .0431511    -0.26   0.796    -.0957392    .0734143
                  Widowed  |   .1574529   .2860796     0.55   0.582    -.4032667    .7181725
                           |
                 ethnicity |
                    Black  |          0  (omitted)
                 Hispanic  |          0  (omitted)
Mixed Race (Non-Hispanic)  |          0  (omitted)
                           |
               child_birth |
               Childbirth  |  -.0544722   .0179502    -3.03   0.002    -.0896548   -.0192896
                     _cons |   3.153631   .0377618    83.51   0.000     3.079618    3.227645
---------------------------+----------------------------------------------------------------
                   sigma_u |  .81739968
                   sigma_e |  1.1765995
                       rho |   .3255215   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------
F test that all u_i=0: F(7125, 48742) = 3.89                 Prob > F = 0.0000

. estimates store fixed

. 
. hausman fixed random

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed        random       Difference       Std. err.
-------------+----------------------------------------------------------------
     edyears |    .1609736     .1509147        .0100589        .0022981
         age |    .1259277     .1272876       -.0013599        .0007413
     mstatus |
          1  |    .4178146     .5107319       -.0929174        .0104614
          2  |   -.0111624     .0454112       -.0565736        .0181276
          3  |    .1574529     .0855097        .0719432        .1151762
1.child_bi~h |   -.0544722    -.0598945        .0054224        .0045632
------------------------------------------------------------------------------
                          b = Consistent under H0 and Ha; obtained from xtreg.
           B = Inconsistent under Ha, efficient under H0; obtained from xtreg.

Test of H0: Difference in coefficients not systematic

    chi2(6) = (b-B)'[(V_b-V_B)^(-1)](b-B)
            = 141.94
Prob > chi2 = 0.0000

. 
. // question five
. by pid: egen age_mean = mean(age)

. by pid: egen mstatus_mean = mean(mstatus)

. 
. xtreg log_income edyears age i.male ib0.mstatus ib4.ethnicity i.child_birth age_mean mstatus_mean, re

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3382                                         min =          1
     Between = 0.5565                                         avg =        7.8
     Overall = 0.4093                                         max =         17

                                                Wald chi2(12)     =   34714.61
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                   edyears |   .1504713   .0030698    49.02   0.000     .1444546     .156488
                       age |   .1281711   .0015913    80.55   0.000     .1250523    .1312899
                           |
                      male |
                     Male  |   .5599864   .0178466    31.38   0.000     .5250078    .5949651
                           |
                   mstatus |
                  Married  |    .446324   .0221098    20.19   0.000     .4029896    .4896584
    Separated or divorced  |  -.0669297    .042986    -1.56   0.119    -.1511807    .0173212
                  Widowed  |   -.092699    .263188    -0.35   0.725    -.6085379      .42314
                           |
                 ethnicity |
                    Black  |  -.3702566   .0193565   -19.13   0.000    -.4081947   -.3323185
                 Hispanic  |  -.0684104   .0203218    -3.37   0.001    -.1082405   -.0285803
Mixed Race (Non-Hispanic)  |  -.3117209   .0812698    -3.84   0.000    -.4710068   -.1524351
                           |
               child_birth |
               Childbirth  |  -.0617159   .0173548    -3.56   0.000    -.0957307   -.0277012
                  age_mean |    .001324   .0031705     0.42   0.676      -.00489     .007538
              mstatus_mean |   .2142337   .0339917     6.30   0.000     .1476112    .2808561
                     _cons |   2.879499   .0581306    49.53   0.000     2.765565    2.993433
---------------------------+----------------------------------------------------------------
                   sigma_u |   .4411512
                   sigma_e |  1.1765995
                       rho |   .1232516   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------

. 
. // question six
. xtreg log_income i.child_birth age i.male ib0.mstatus ib4.ethnicity edyears age_mean mstatus_mean, re

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3382                                         min =          1
     Between = 0.5565                                         avg =        7.8
     Overall = 0.4093                                         max =         17

                                                Wald chi2(12)     =   34714.61
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
               child_birth |
               Childbirth  |  -.0617159   .0173548    -3.56   0.000    -.0957307   -.0277012
                       age |   .1281711   .0015913    80.55   0.000     .1250523    .1312899
                           |
                      male |
                     Male  |   .5599864   .0178466    31.38   0.000     .5250078    .5949651
                           |
                   mstatus |
                  Married  |    .446324   .0221098    20.19   0.000     .4029896    .4896584
    Separated or divorced  |  -.0669297    .042986    -1.56   0.119    -.1511807    .0173212
                  Widowed  |   -.092699    .263188    -0.35   0.725    -.6085379      .42314
                           |
                 ethnicity |
                    Black  |  -.3702566   .0193565   -19.13   0.000    -.4081947   -.3323185
                 Hispanic  |  -.0684104   .0203218    -3.37   0.001    -.1082405   -.0285803
Mixed Race (Non-Hispanic)  |  -.3117209   .0812698    -3.84   0.000    -.4710068   -.1524351
                           |
                   edyears |   .1504713   .0030698    49.02   0.000     .1444546     .156488
                  age_mean |    .001324   .0031705     0.42   0.676      -.00489     .007538
              mstatus_mean |   .2142337   .0339917     6.30   0.000     .1476112    .2808561
                     _cons |   2.879499   .0581306    49.53   0.000     2.765565    2.993433
---------------------------+----------------------------------------------------------------
                   sigma_u |   .4411512
                   sigma_e |  1.1765995
                       rho |   .1232516   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------

. 
. xtreg log_income i.child_birth##i.male age ib0.mstatus ib4.ethnicity edyears age_mean mstatus_mean, re

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3396                                         min =          1
     Between = 0.5563                                         avg =        7.8
     Overall = 0.4106                                         max =         17

                                                Wald chi2(13)     =   34887.51
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
               child_birth |
               Childbirth  |  -.3389846   .0311873   -10.87   0.000    -.4001106   -.2778586
                           |
                      male |
                     Male  |   .5164807   .0183031    28.22   0.000     .4806073     .552354
                           |
          child_birth#male |
          Childbirth#Male  |   .3959173   .0370148    10.70   0.000     .3233696    .4684649
                           |
                       age |   .1271947   .0015921    79.89   0.000     .1240742    .1303151
                           |
                   mstatus |
                  Married  |   .4457888   .0220841    20.19   0.000     .4025047    .4890729
    Separated or divorced  |  -.0692326   .0429362    -1.61   0.107     -.153386    .0149208
                  Widowed  |  -.0877785   .2629386    -0.33   0.739    -.6031287    .4275717
                           |
                 ethnicity |
                    Black  |  -.3674041   .0193601   -18.98   0.000    -.4053493   -.3294589
                 Hispanic  |  -.0679749   .0203242    -3.34   0.001    -.1078097   -.0281402
Mixed Race (Non-Hispanic)  |  -.3042815   .0812831    -3.74   0.000    -.4635934   -.1449696
                           |
                   edyears |   .1512319   .0030685    49.29   0.000     .1452178    .1572461
                  age_mean |   .0020623   .0031705     0.65   0.515    -.0041518    .0082765
              mstatus_mean |   .2211022   .0339932     6.50   0.000     .1544767    .2877277
                     _cons |   2.903208   .0581657    49.91   0.000     2.789205     3.01721
---------------------------+----------------------------------------------------------------
                   sigma_u |  .44179274
                   sigma_e |  1.1753411
                       rho |  .12379798   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------

. 
. test 1.child_birth#1.male

 ( 1)  1.child_birth#1.male = 0

           chi2(  1) =  114.41
         Prob > chi2 =    0.0000

. 
. // question eight
. bysort pid (wave): gen n_waves = _N

. gen all_waves = n_waves == 17

. 
. xtreg log_income i.child_birth##i.male age ib0.mstatus ib4.ethnicity edyears age_mean mstatus_mean all_waves, re

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3396                                         min =          1
     Between = 0.5565                                         avg =        7.8
     Overall = 0.4108                                         max =         17

                                                Wald chi2(14)     =   34898.11
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
               child_birth |
               Childbirth  |  -.3376199   .0311923   -10.82   0.000    -.3987556   -.2764841
                           |
                      male |
                     Male  |   .5145924    .018317    28.09   0.000     .4786918    .5504931
                           |
          child_birth#male |
          Childbirth#Male  |   .3970959   .0370174    10.73   0.000     .3245431    .4696487
                           |
                       age |   .1272067   .0015921    79.90   0.000     .1240862    .1303271
                           |
                   mstatus |
                  Married  |   .4450516   .0220863    20.15   0.000     .4017632      .48834
    Separated or divorced  |  -.0686635   .0429367    -1.60   0.110    -.1528179    .0154908
                  Widowed  |  -.0913118   .2629289    -0.35   0.728     -.606643    .4240195
                           |
                 ethnicity |
                    Black  |    -.36595   .0193655   -18.90   0.000    -.4039057   -.3279944
                 Hispanic  |  -.0672713   .0203211    -3.31   0.001    -.1070998   -.0274427
Mixed Race (Non-Hispanic)  |  -.3057978   .0812634    -3.76   0.000    -.4650712   -.1465244
                           |
                   edyears |   .1511261   .0030685    49.25   0.000     .1451119    .1571402
                  age_mean |  -.0000506   .0032976    -0.02   0.988    -.0065138    .0064127
              mstatus_mean |   .2219983   .0339879     6.53   0.000     .1553832    .2886135
                 all_waves |   .0586057   .0252287     2.32   0.020     .0091584    .1080531
                     _cons |   2.941761   .0604685    48.65   0.000     2.823245    3.060277
---------------------------+----------------------------------------------------------------
                   sigma_u |  .44156498
                   sigma_e |  1.1753411
                       rho |  .12368615   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------

. 
. bysort pid (wave): gen next_wave = (wave[_n+1] == wave + 1)

. 
. xtreg log_income i.child_birth##i.male age ib0.mstatus ib4.ethnicity edyears age_mean mstatus_mean next_wave, re

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3398                                         min =          1
     Between = 0.5567                                         avg =        7.8
     Overall = 0.4109                                         max =         17

                                                Wald chi2(14)     =   34925.32
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
               child_birth |
               Childbirth  |  -.3360987   .0311888   -10.78   0.000    -.3972277   -.2749698
                           |
                      male |
                     Male  |   .5164726   .0182941    28.23   0.000     .4806168    .5523285
                           |
          child_birth#male |
          Childbirth#Male  |   .3941373   .0370111    10.65   0.000      .321597    .4666777
                           |
                       age |   .1290399   .0016411    78.63   0.000     .1258235    .1322563
                           |
                   mstatus |
                  Married  |   .4434815   .0220869    20.08   0.000      .400192     .486771
    Separated or divorced  |  -.0704448   .0429312    -1.64   0.101    -.1545884    .0136988
                  Widowed  |  -.0932177   .2628879    -0.35   0.723    -.6084685    .4220331
                           |
                 ethnicity |
                    Black  |  -.3668404   .0193504   -18.96   0.000    -.4047665   -.3289142
                 Hispanic  |  -.0678861   .0203135    -3.34   0.001    -.1076998   -.0280724
Mixed Race (Non-Hispanic)  |   -.306116   .0812407    -3.77   0.000    -.4653448   -.1468872
                           |
                   edyears |   .1508521   .0030687    49.16   0.000     .1448375    .1568666
                  age_mean |  -.0013797   .0032553    -0.42   0.672    -.0077599    .0050006
              mstatus_mean |   .2226335   .0339795     6.55   0.000      .156035     .289232
                 next_wave |   .0640908   .0138574     4.63   0.000     .0369307    .0912508
                     _cons |   2.893069   .0581815    49.72   0.000     2.779036    3.007103
---------------------------+----------------------------------------------------------------
                   sigma_u |  .44138618
                   sigma_e |  1.1751683
                       rho |  .12363024   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------

. 
. xtreg log_income i.child_birth##i.male age ib0.mstatus ib4.ethnicity edyears age_mean mstatus_mean n_waves, re

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3396                                         min =          1
     Between = 0.5567                                         avg =        7.8
     Overall = 0.4108                                         max =         17

                                                Wald chi2(14)     =   34902.86
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
               child_birth |
               Childbirth  |  -.3357807   .0312153   -10.76   0.000    -.3969615   -.2745999
                           |
                      male |
                     Male  |   .5102574   .0184703    27.63   0.000     .4740564    .5464584
                           |
          child_birth#male |
          Childbirth#Male  |   .3978771   .0370232    10.75   0.000      .325313    .4704412
                           |
                       age |   .1272105   .0015921    79.90   0.000       .12409     .130331
                           |
                   mstatus |
                  Married  |   .4450939   .0220869    20.15   0.000     .4018044    .4883835
    Separated or divorced  |  -.0698697   .0429384    -1.63   0.104    -.1540274     .014288
                  Widowed  |   -.086507   .2629187    -0.33   0.742    -.6018182    .4288043
                           |
                 ethnicity |
                    Black  |  -.3666043   .0193514   -18.94   0.000    -.4045323   -.3286762
                 Hispanic  |  -.0675925   .0203121    -3.33   0.001    -.1074035   -.0277814
Mixed Race (Non-Hispanic)  |  -.3057612   .0812335    -3.76   0.000     -.464976   -.1465464
                           |
                   edyears |    .151004   .0030692    49.20   0.000     .1449886    .1570194
                  age_mean |  -.0058197   .0045119    -1.29   0.197    -.0146628    .0030235
              mstatus_mean |   .2209533   .0339763     6.50   0.000     .1543609    .2875457
                   n_waves |   .0065212   .0026583     2.45   0.014      .001311    .0117314
                     _cons |   3.010715     .07277    41.37   0.000     2.868088    3.153341
---------------------------+----------------------------------------------------------------
                   sigma_u |  .44121779
                   sigma_e |  1.1753411
                       rho |  .12351574   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------

. 
. // save data
. save "$cleandata/childbirth_clean.dta", replace
file C:/Users/andres/repositories/am.as2/report/stata/data/clean/childbirth_clean.dta saved

. 
. // close log
. log close
      name:  <unnamed>
       log:  C:/Users/andres/repositories/am.as2/report/stata/output/logs/main.log
  log type:  text
 closed on:  28 Sep 2025, 23:22:24
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
