-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/andres/repositories/am.as2/report/stata/output/logs/main.log
  log type:  text
 opened on:  30 Sep 2025, 13:32:18

. 
. // load data
. use "$rawdata/childbirth.dta", clear

. 
. // clean data
. save "$cleandata/childbirth_clean.dta", replace
file C:/Users/andres/repositories/am.as2/report/stata/data/clean/childbirth_clean.dta saved

. 
. label define child_lbl ///
>         0 "No childbirth" ///
>         1 "Childbirth in past year"

. label values child_birth child_lbl

. 
. // question one
. bysort pid: egen max_edyears = max(edyears)

. 
. gen edyears_cat = .
(55,874 missing values generated)

. replace edyears_cat = 1 if max_edyears <= 11 & !missing(edyears)
(10,272 real changes made)

. replace edyears_cat = 2 if max_edyears == 12 & !missing(edyears)
(15,182 real changes made)

. replace edyears_cat = 3 if max_edyears >= 13 & max_edyears <= 15 & !missing(edyears)
(16,249 real changes made)

. replace edyears_cat = 4 if max_edyears >= 16 & !missing(edyears)
(14,171 real changes made)

. 
. label var edyears_cat "Education Category"

. label define edyears_lbl ///
>         1 "Less than HS" ///
>         2 "HS graduate" ///
>         3 "Some college" ///
>         4 "College degree or more"

. label values edyears_cat edyears_lbl

. 
. graph bar (mean) income, over(edyears_cat)

. graph bar (mean) income, over(edyears_cat) by(male)

. 
. // question two
. gen log_income = log(income)

. reg log_income edyears age i.male ib0.mstatus ib4.ethnicity i.child_birth, r

Linear regression                               Number of obs     =     55,874
                                                F(10, 55863)      =    3875.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4089
                                                Root MSE          =     1.3368

--------------------------------------------------------------------------------------------
                           |               Robust
                log_income | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                   edyears |    .145754   .0030809    47.31   0.000     .1397155    .1517924
                       age |   .1262801   .0017393    72.61   0.000     .1228711    .1296891
                           |
                      male |
                     Male  |   .5999785   .0115407    51.99   0.000     .5773585    .6225984
                           |
                   mstatus |
                  Married  |   .6188734   .0210868    29.35   0.000     .5775431    .6602037
    Separated or divorced  |   .0766986   .0471873     1.63   0.104    -.0157889     .169186
                  Widowed  |   .0647223   .2689565     0.24   0.810    -.4624343    .5918788
                           |
                 ethnicity |
                    Black  |  -.4285689    .013877   -30.88   0.000     -.455768   -.4013698
                 Hispanic  |  -.0825348     .01473    -5.60   0.000    -.1114057   -.0536639
Mixed Race (Non-Hispanic)  |  -.3744138   .0626635    -5.97   0.000    -.4972347   -.2515929
                           |
               child_birth |
  Childbirth in past year  |  -.0794501   .0197668    -4.02   0.000    -.1181932   -.0407071
                     _cons |   3.015595   .0317777    94.90   0.000      2.95331    3.077879
--------------------------------------------------------------------------------------------

. 
. reg log_income i.edyears_cat##i.male age ib0.mstatus ib4.ethnicity i.child_birth, r

Linear regression                               Number of obs     =     55,874
                                                F(15, 55858)      =    2380.33
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3920
                                                Root MSE          =     1.3559

----------------------------------------------------------------------------------------------
                             |               Robust
                  log_income | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
                 edyears_cat |
                HS graduate  |   .1611156   .0242416     6.65   0.000     .1136019    .2086292
               Some college  |   .3592922   .0241376    14.89   0.000     .3119823    .4066021
     College degree or more  |   .4755869   .0270367    17.59   0.000     .4225948     .528579
                             |
                        male |
                       Male  |   .3647052   .0234901    15.53   0.000     .3186645    .4107459
                             |
            edyears_cat#male |
           HS graduate#Male  |   .2498171    .032511     7.68   0.000     .1860953     .313539
          Some college#Male  |   .2201233   .0321917     6.84   0.000     .1570274    .2832192
College degree or more#Male  |   .1978666   .0338261     5.85   0.000     .1315673    .2641659
                             |
                         age |   .1591478   .0014892   106.87   0.000     .1562289    .1620666
                             |
                     mstatus |
                    Married  |   .5959157   .0212778    28.01   0.000     .5542111    .6376203
      Separated or divorced  |  -.0538891    .048065    -1.12   0.262    -.1480967    .0403185
                    Widowed  |  -.1766605   .2635732    -0.67   0.503    -.6932656    .3399446
                             |
                   ethnicity |
                      Black  |  -.4637154   .0141635   -32.74   0.000    -.4914759   -.4359549
                   Hispanic  |  -.1137228   .0149566    -7.60   0.000    -.1430378   -.0844079
  Mixed Race (Non-Hispanic)  |  -.3562787   .0624904    -5.70   0.000    -.4787603   -.2337971
                             |
                 child_birth |
    Childbirth in past year  |  -.0902205   .0200405    -4.50   0.000       -.1295    -.050941
                       _cons |   3.818825    .030731   124.27   0.000     3.758592    3.879058
----------------------------------------------------------------------------------------------

. test 2.edyears_cat#1.male 3.edyears_cat#1.male 4.edyears_cat#1.male

 ( 1)  2.edyears_cat#1.male = 0
 ( 2)  3.edyears_cat#1.male = 0
 ( 3)  4.edyears_cat#1.male = 0

       F(  3, 55858) =   23.86
            Prob > F =    0.0000

. 
. // question three
. xtset pid wave

Panel variable: pid (unbalanced)
 Time variable: wave, 2 to 18, but with gaps
         Delta: 1 unit

. xtreg log_income edyears age i.male ib0.mstatus ib4.ethnicity i.child_birth, re

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3380                                         min =          1
     Between = 0.5546                                         avg =        7.8
     Overall = 0.4084                                         max =         17

                                                Wald chi2(10)     =   34633.21
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                   edyears |   .1509147   .0030581    49.35   0.000     .1449209    .1569085
                       age |   .1272876   .0014948    85.16   0.000      .124358    .1302173
                           |
                      male |
                     Male  |   .5698314   .0167349    34.05   0.000     .5370316    .6026312
                           |
                   mstatus |
                  Married  |   .5107319    .019666    25.97   0.000     .4721873    .5492766
    Separated or divorced  |   .0454112   .0391588     1.16   0.246    -.0313386     .122161
                  Widowed  |   .0855097   .2618702     0.33   0.744    -.4277464    .5987658
                           |
                 ethnicity |
                    Black  |  -.3832821   .0191953   -19.97   0.000    -.4209042   -.3456599
                 Hispanic  |  -.0655308   .0203229    -3.22   0.001    -.1053629   -.0256986
Mixed Race (Non-Hispanic)  |     -.3244     .08128    -3.99   0.000    -.4837059    -.165094
                           |
               child_birth |
  Childbirth in past year  |  -.0598945   .0173605    -3.45   0.001    -.0939204   -.0258686
                     _cons |   2.942328   .0341275    86.22   0.000      2.87544    3.009217
---------------------------+----------------------------------------------------------------
                   sigma_u |   .4411512
                   sigma_e |  1.1765995
                       rho |   .1232516   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------

. estimates store random

. 
. // question four
. xtreg log_income edyears age i.male ib0.mstatus ib4.ethnicity i.child_birth, fe
note: 1.male omitted because of collinearity.
note: 1.ethnicity omitted because of collinearity.
note: 2.ethnicity omitted because of collinearity.
note: 3.ethnicity omitted because of collinearity.

Fixed-effects (within) regression               Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3383                                         min =          1
     Between = 0.4945                                         avg =        7.8
     Overall = 0.3713                                         max =         17

                                                F(6, 48742)       =    4154.09
corr(u_i, Xb) = 0.0706                          Prob > F          =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                   edyears |   .1609736   .0038254    42.08   0.000     .1534758    .1684713
                       age |   .1259277   .0016685    75.47   0.000     .1226575    .1291979
                           |
                      male |
                     Male  |          0  (omitted)
                           |
                   mstatus |
                  Married  |   .4178146   .0222754    18.76   0.000     .3741545    .4614746
    Separated or divorced  |  -.0111624   .0431511    -0.26   0.796    -.0957392    .0734143
                  Widowed  |   .1574529   .2860796     0.55   0.582    -.4032667    .7181725
                           |
                 ethnicity |
                    Black  |          0  (omitted)
                 Hispanic  |          0  (omitted)
Mixed Race (Non-Hispanic)  |          0  (omitted)
                           |
               child_birth |
  Childbirth in past year  |  -.0544722   .0179502    -3.03   0.002    -.0896548   -.0192896
                     _cons |   3.153631   .0377618    83.51   0.000     3.079618    3.227645
---------------------------+----------------------------------------------------------------
                   sigma_u |  .81739968
                   sigma_e |  1.1765995
                       rho |   .3255215   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------
F test that all u_i=0: F(7125, 48742) = 3.89                 Prob > F = 0.0000

. estimates store fixed

. hausman fixed random

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed        random       Difference       Std. err.
-------------+----------------------------------------------------------------
     edyears |    .1609736     .1509147        .0100589        .0022981
         age |    .1259277     .1272876       -.0013599        .0007413
     mstatus |
          1  |    .4178146     .5107319       -.0929174        .0104614
          2  |   -.0111624     .0454112       -.0565736        .0181276
          3  |    .1574529     .0855097        .0719432        .1151762
1.child_bi~h |   -.0544722    -.0598945        .0054224        .0045632
------------------------------------------------------------------------------
                          b = Consistent under H0 and Ha; obtained from xtreg.
           B = Inconsistent under Ha, efficient under H0; obtained from xtreg.

Test of H0: Difference in coefficients not systematic

    chi2(6) = (b-B)'[(V_b-V_B)^(-1)](b-B)
            = 141.94
Prob > chi2 = 0.0000

. 
. // question five
. by pid: egen edyears_mean = mean(edyears)

. by pid: egen age_mean = mean(age)

. by pid: egen male_mean = mean(male)

. by pid: egen mstatus_mean = mean(mstatus)

. by pid: egen ethnicity_mean = mean(ethnicity)

. by pid: egen child_birth_mean = mean(child_birth)

. 
. xtreg log_income edyears age i.male ib0.mstatus ib4.ethnicity i.child_birth ///
>         age_mean mstatus_mean child_birth_mean edyears_mean male_mean ethnicity_mean, re
note: male_mean omitted because of collinearity.
note: ethnicity_mean omitted because of collinearity.

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3383                                         min =          1
     Between = 0.5569                                         avg =        7.8
     Overall = 0.4096                                         max =         17

                                                Wald chi2(14)     =   34746.58
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                   edyears |   .1607359   .0039049    41.16   0.000     .1530825    .1683893
                       age |   .1255271    .001702    73.75   0.000     .1221912     .128863
                           |
                      male |
                     Male  |   .5505443   .0179691    30.64   0.000     .5153255    .5857631
                           |
                   mstatus |
                  Married  |   .4503732   .0221364    20.35   0.000     .4069867    .4937598
    Separated or divorced  |  -.0626617    .043024    -1.46   0.145    -.1469871    .0216637
                  Widowed  |   -.076685   .2631689    -0.29   0.771    -.5924865    .4391165
                           |
                 ethnicity |
                    Black  |  -.3804521   .0196145   -19.40   0.000    -.4188958   -.3420083
                 Hispanic  |  -.0768994   .0204893    -3.75   0.000    -.1170578    -.036741
Mixed Race (Non-Hispanic)  |  -.3088517   .0812656    -3.80   0.000    -.4681294   -.1495741
                           |
               child_birth |
  Childbirth in past year  |  -.0576843   .0183171    -3.15   0.002    -.0935851   -.0217834
                  age_mean |   .0109329    .003817     2.86   0.004     .0034516    .0184142
              mstatus_mean |   .2104923   .0346966     6.07   0.000     .1424883    .2784964
          child_birth_mean |  -.0878591   .0578693    -1.52   0.129    -.2012809    .0255627
              edyears_mean |  -.0284737   .0063983    -4.45   0.000    -.0410142   -.0159332
                 male_mean |          0  (omitted)
            ethnicity_mean |          0  (omitted)
                     _cons |   2.964409    .061364    48.31   0.000     2.844138     3.08468
---------------------------+----------------------------------------------------------------
                   sigma_u |   .4411512
                   sigma_e |  1.1765995
                       rho |   .1232516   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------

. test age_mean mstatus_mean child_birth_mean edyears_mean male_mean ethnicity_mean

 ( 1)  age_mean = 0
 ( 2)  mstatus_mean = 0
 ( 3)  child_birth_mean = 0
 ( 4)  edyears_mean = 0
 ( 5)  o.male_mean = 0
 ( 6)  o.ethnicity_mean = 0
       Constraint 5 dropped
       Constraint 6 dropped

           chi2(  4) =   71.51
         Prob > chi2 =    0.0000

. 
. // question six
. xtreg log_income i.child_birth age i.male ib0.mstatus ib4.ethnicity edyears, re

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3380                                         min =          1
     Between = 0.5546                                         avg =        7.8
     Overall = 0.4084                                         max =         17

                                                Wald chi2(10)     =   34633.21
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
               child_birth |
  Childbirth in past year  |  -.0598945   .0173605    -3.45   0.001    -.0939204   -.0258686
                       age |   .1272876   .0014948    85.16   0.000      .124358    .1302173
                           |
                      male |
                     Male  |   .5698314   .0167349    34.05   0.000     .5370316    .6026312
                           |
                   mstatus |
                  Married  |   .5107319    .019666    25.97   0.000     .4721873    .5492766
    Separated or divorced  |   .0454112   .0391588     1.16   0.246    -.0313386     .122161
                  Widowed  |   .0855097   .2618702     0.33   0.744    -.4277464    .5987658
                           |
                 ethnicity |
                    Black  |  -.3832821   .0191953   -19.97   0.000    -.4209042   -.3456599
                 Hispanic  |  -.0655308   .0203229    -3.22   0.001    -.1053629   -.0256986
Mixed Race (Non-Hispanic)  |     -.3244     .08128    -3.99   0.000    -.4837059    -.165094
                           |
                   edyears |   .1509147   .0030581    49.35   0.000     .1449209    .1569085
                     _cons |   2.942328   .0341275    86.22   0.000      2.87544    3.009217
---------------------------+----------------------------------------------------------------
                   sigma_u |   .4411512
                   sigma_e |  1.1765995
                       rho |   .1232516   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------

. estimates store random

. xtreg log_income i.child_birth age i.male ib0.mstatus ib4.ethnicity edyears, fe
note: 1.male omitted because of collinearity.
note: 1.ethnicity omitted because of collinearity.
note: 2.ethnicity omitted because of collinearity.
note: 3.ethnicity omitted because of collinearity.

Fixed-effects (within) regression               Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3383                                         min =          1
     Between = 0.4945                                         avg =        7.8
     Overall = 0.3713                                         max =         17

                                                F(6, 48742)       =    4154.09
corr(u_i, Xb) = 0.0706                          Prob > F          =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
               child_birth |
  Childbirth in past year  |  -.0544722   .0179502    -3.03   0.002    -.0896548   -.0192896
                       age |   .1259277   .0016685    75.47   0.000     .1226575    .1291979
                           |
                      male |
                     Male  |          0  (omitted)
                           |
                   mstatus |
                  Married  |   .4178146   .0222754    18.76   0.000     .3741545    .4614746
    Separated or divorced  |  -.0111624   .0431511    -0.26   0.796    -.0957392    .0734143
                  Widowed  |   .1574529   .2860796     0.55   0.582    -.4032667    .7181725
                           |
                 ethnicity |
                    Black  |          0  (omitted)
                 Hispanic  |          0  (omitted)
Mixed Race (Non-Hispanic)  |          0  (omitted)
                           |
                   edyears |   .1609736   .0038254    42.08   0.000     .1534758    .1684713
                     _cons |   3.153631   .0377618    83.51   0.000     3.079618    3.227645
---------------------------+----------------------------------------------------------------
                   sigma_u |  .81739968
                   sigma_e |  1.1765995
                       rho |   .3255215   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------
F test that all u_i=0: F(7125, 48742) = 3.89                 Prob > F = 0.0000

. estimates store fixed

. hausman fixed random

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |     fixed        random       Difference       Std. err.
-------------+----------------------------------------------------------------
1.child_bi~h |   -.0544722    -.0598945        .0054224        .0045632
         age |    .1259277     .1272876       -.0013599        .0007413
     mstatus |
          1  |    .4178146     .5107319       -.0929174        .0104614
          2  |   -.0111624     .0454112       -.0565736        .0181276
          3  |    .1574529     .0855097        .0719432        .1151762
     edyears |    .1609736     .1509147        .0100589        .0022981
------------------------------------------------------------------------------
                          b = Consistent under H0 and Ha; obtained from xtreg.
           B = Inconsistent under Ha, efficient under H0; obtained from xtreg.

Test of H0: Difference in coefficients not systematic

    chi2(6) = (b-B)'[(V_b-V_B)^(-1)](b-B)
            = 141.94
Prob > chi2 = 0.0000

. 
. xtreg log_income i.child_birth age i.male ib0.mstatus ib4.ethnicity edyears ///
>         age_mean mstatus_mean child_birth_mean edyears_mean male_mean ethnicity_mean, re
note: male_mean omitted because of collinearity.
note: ethnicity_mean omitted because of collinearity.

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3383                                         min =          1
     Between = 0.5569                                         avg =        7.8
     Overall = 0.4096                                         max =         17

                                                Wald chi2(14)     =   34746.58
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

--------------------------------------------------------------------------------------------
                log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
               child_birth |
  Childbirth in past year  |  -.0576843   .0183171    -3.15   0.002    -.0935851   -.0217834
                       age |   .1255271    .001702    73.75   0.000     .1221912     .128863
                           |
                      male |
                     Male  |   .5505443   .0179691    30.64   0.000     .5153255    .5857631
                           |
                   mstatus |
                  Married  |   .4503732   .0221364    20.35   0.000     .4069867    .4937598
    Separated or divorced  |  -.0626617    .043024    -1.46   0.145    -.1469871    .0216637
                  Widowed  |   -.076685   .2631689    -0.29   0.771    -.5924865    .4391165
                           |
                 ethnicity |
                    Black  |  -.3804521   .0196145   -19.40   0.000    -.4188958   -.3420083
                 Hispanic  |  -.0768994   .0204893    -3.75   0.000    -.1170578    -.036741
Mixed Race (Non-Hispanic)  |  -.3088517   .0812656    -3.80   0.000    -.4681294   -.1495741
                           |
                   edyears |   .1607359   .0039049    41.16   0.000     .1530825    .1683893
                  age_mean |   .0109329    .003817     2.86   0.004     .0034516    .0184142
              mstatus_mean |   .2104923   .0346966     6.07   0.000     .1424883    .2784964
          child_birth_mean |  -.0878591   .0578693    -1.52   0.129    -.2012809    .0255627
              edyears_mean |  -.0284737   .0063983    -4.45   0.000    -.0410142   -.0159332
                 male_mean |          0  (omitted)
            ethnicity_mean |          0  (omitted)
                     _cons |   2.964409    .061364    48.31   0.000     2.844138     3.08468
---------------------------+----------------------------------------------------------------
                   sigma_u |   .4411512
                   sigma_e |  1.1765995
                       rho |   .1232516   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------

. xtreg log_income i.child_birth##i.male age ib0.mstatus ib4.ethnicity edyears ///
>         age_mean mstatus_mean child_birth_mean edyears_mean male_mean ethnicity_mean, re
note: male_mean omitted because of collinearity.
note: ethnicity_mean omitted because of collinearity.

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3397                                         min =          1
     Between = 0.5568                                         avg =        7.8
     Overall = 0.4109                                         max =         17

                                                Wald chi2(15)     =   34919.38
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

-----------------------------------------------------------------------------------------------
                   log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
------------------------------+----------------------------------------------------------------
                  child_birth |
     Childbirth in past year  |   -.340031   .0321253   -10.58   0.000    -.4029955   -.2770666
                              |
                         male |
                        Male  |   .5073913   .0184156    27.55   0.000     .4712973    .5434853
                              |
             child_birth#male |
Childbirth in past year#Male  |    .396726   .0371038    10.69   0.000     .3240039    .4694481
                              |
                          age |   .1244796   .0017028    73.10   0.000     .1211423     .127817
                              |
                      mstatus |
                     Married  |   .4503206   .0221106    20.37   0.000     .4069846    .4936566
       Separated or divorced  |  -.0637282   .0429736    -1.48   0.138    -.1479549    .0204986
                     Widowed  |  -.0725023   .2629196    -0.28   0.783    -.5878153    .4428106
                              |
                    ethnicity |
                       Black  |  -.3791587   .0196169   -19.33   0.000    -.4176072   -.3407102
                    Hispanic  |  -.0777492    .020492    -3.79   0.000    -.1179128   -.0375856
   Mixed Race (Non-Hispanic)  |  -.3022505   .0812784    -3.72   0.000    -.4615532   -.1429478
                              |
                      edyears |   .1619349   .0039016    41.50   0.000     .1542878     .169582
                     age_mean |   .0114204   .0038168     2.99   0.003     .0039395    .0189012
                 mstatus_mean |   .2121205   .0346923     6.11   0.000     .1441248    .2801162
             child_birth_mean |  -.0445995   .0579956    -0.77   0.442    -.1582689    .0690698
                 edyears_mean |  -.0288759   .0063964    -4.51   0.000    -.0414126   -.0163392
                    male_mean |          0  (omitted)
               ethnicity_mean |          0  (omitted)
                        _cons |   2.991333   .0614115    48.71   0.000     2.870969    3.111697
------------------------------+----------------------------------------------------------------
                      sigma_u |  .44179274
                      sigma_e |  1.1753411
                          rho |  .12379798   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------------------

. test 1.child_birth#1.male

 ( 1)  1.child_birth#1.male = 0

           chi2(  1) =  114.33
         Prob > chi2 =    0.0000

. 
. // question eight
. xtset pid wave

Panel variable: pid (unbalanced)
 Time variable: wave, 2 to 18, but with gaps
         Delta: 1 unit

. xtdescribe

     pid:  2, 4, ..., 9022                                   n =       7126
    wave:  2, 3, ..., 18                                     T =         17
           Delta(wave) = 1 unit
           Span(wave)  = 17 periods
           (pid*wave uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                         1       1       3         7        13      17      17

     Freq.  Percent    Cum. |  Pattern
 ---------------------------+-------------------
      758     10.64   10.64 |  1................
      601      8.43   19.07 |  11111111111111111
      534      7.49   26.56 |  11...............
      449      6.30   32.87 |  111..............
      347      4.87   37.74 |  11111............
      343      4.81   42.55 |  1111.............
      260      3.65   46.20 |  111111...........
      214      3.00   49.20 |  1111111..........
      198      2.78   51.98 |  11111111.........
     3422     48.02  100.00 | (other patterns)
 ---------------------------+-------------------
     7126    100.00         |  XXXXXXXXXXXXXXXXX

. 
. bysort pid (wave): gen n_waves = _N

. gen all_waves = n_waves == 17

. xtreg log_income i.child_birth##i.male age ib0.mstatus ib4.ethnicity edyears age_mean mstatus_mean child_birth_mean edyears_mean male_mean ethnicity_mean all_waves, re
note: male_mean omitted because of collinearity.
note: ethnicity_mean omitted because of collinearity.

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3397                                         min =          1
     Between = 0.5571                                         avg =        7.8
     Overall = 0.4110                                         max =         17

                                                Wald chi2(16)     =   34929.90
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

-----------------------------------------------------------------------------------------------
                   log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
------------------------------+----------------------------------------------------------------
                  child_birth |
     Childbirth in past year  |  -.3415257   .0321313   -10.63   0.000    -.4045019   -.2785494
                              |
                         male |
                        Male  |   .5056941   .0184261    27.44   0.000     .4695796    .5418085
                              |
             child_birth#male |
Childbirth in past year#Male  |   .3988969   .0371148    10.75   0.000     .3261533    .4716405
                              |
                          age |   .1244805   .0017028    73.10   0.000     .1211432    .1278179
                              |
                      mstatus |
                     Married  |   .4497693   .0221118    20.34   0.000      .406431    .4931077
       Separated or divorced  |   -.062609   .0429763    -1.46   0.145     -.146841    .0216229
                     Widowed  |  -.0765543   .2629115    -0.29   0.771    -.5918513    .4387427
                              |
                    ethnicity |
                       Black  |  -.3783168   .0196153   -19.29   0.000     -.416762   -.3398716
                    Hispanic  |  -.0775559   .0204866    -3.79   0.000     -.117709   -.0374029
   Mixed Race (Non-Hispanic)  |  -.3041971   .0812605    -3.74   0.000    -.4634647   -.1449296
                              |
                      edyears |   .1619443   .0039017    41.51   0.000     .1542972    .1695915
                     age_mean |     .00907   .0039488     2.30   0.022     .0013305    .0168095
                 mstatus_mean |   .2105866   .0346912     6.07   0.000     .1425932    .2785801
             child_birth_mean |  -.0231221   .0587262    -0.39   0.694    -.1382234    .0919792
                 edyears_mean |  -.0287716   .0063954    -4.50   0.000    -.0413063   -.0162368
                    male_mean |          0  (omitted)
               ethnicity_mean |          0  (omitted)
                    all_waves |   .0590859   .0255516     2.31   0.021     .0090056    .1091662
                        _cons |   3.030843   .0637263    47.56   0.000     2.905942    3.155744
------------------------------+----------------------------------------------------------------
                      sigma_u |  .44156498
                      sigma_e |  1.1753411
                          rho |  .12368615   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------------------

. 
. bysort pid (wave): gen next_wave = (wave[_n+1] == wave + 1)

. xtreg log_income i.child_birth##i.male age ib0.mstatus ib4.ethnicity edyears age_mean mstatus_mean child_birth_mean edyears_mean male_mean ethnicity_mean next_wave, re
note: male_mean omitted because of collinearity.
note: ethnicity_mean omitted because of collinearity.

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3399                                         min =          1
     Between = 0.5573                                         avg =        7.8
     Overall = 0.4112                                         max =         17

                                                Wald chi2(16)     =   34959.21
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

-----------------------------------------------------------------------------------------------
                   log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
------------------------------+----------------------------------------------------------------
                  child_birth |
     Childbirth in past year  |  -.3418617   .0321226   -10.64   0.000     -.404821   -.2789025
                              |
                         male |
                        Male  |   .5074651   .0184064    27.57   0.000     .4713892    .5435409
                              |
             child_birth#male |
Childbirth in past year#Male  |   .3965436   .0370976    10.69   0.000     .3238336    .4692535
                              |
                          age |   .1262967   .0017449    72.38   0.000     .1228768    .1297167
                              |
                      mstatus |
                     Married  |   .4483776   .0221113    20.28   0.000     .4050403    .4917149
       Separated or divorced  |  -.0639148   .0429674    -1.49   0.137    -.1481294    .0202998
                     Widowed  |  -.0785185   .2628664    -0.30   0.765    -.5937272    .4366902
                              |
                    ethnicity |
                       Black  |  -.3799537   .0196071   -19.38   0.000    -.4183828   -.3415246
                    Hispanic  |  -.0788002   .0204821    -3.85   0.000    -.1189443   -.0386561
   Mixed Race (Non-Hispanic)  |  -.3047912   .0812359    -3.75   0.000    -.4640106   -.1455719
                              |
                      edyears |   .1620428   .0039012    41.54   0.000     .1543965     .169689
                     age_mean |   .0077523   .0038921     1.99   0.046      .000124    .0153806
                 mstatus_mean |   .2093796   .0346811     6.04   0.000     .1414059    .2773532
             child_birth_mean |  -.0100186   .0584264    -0.17   0.864    -.1245323    .1044952
                 edyears_mean |  -.0295333   .0063953    -4.62   0.000    -.0420678   -.0169987
                    male_mean |          0  (omitted)
               ethnicity_mean |          0  (omitted)
                    next_wave |   .0664742    .013976     4.76   0.000     .0390817    .0938668
                        _cons |   2.984424   .0613995    48.61   0.000     2.864083    3.104765
------------------------------+----------------------------------------------------------------
                      sigma_u |  .44138618
                      sigma_e |  1.1751683
                          rho |  .12363024   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------------------

. 
. xtreg log_income i.child_birth##i.male age ib0.mstatus ib4.ethnicity edyears age_mean mstatus_mean child_birth_mean edyears_mean male_mean ethnicity_mean n_waves, re
note: male_mean omitted because of collinearity.
note: ethnicity_mean omitted because of collinearity.

Random-effects GLS regression                   Number of obs     =     55,874
Group variable: pid                             Number of groups  =      7,126

R-squared:                                      Obs per group:
     Within  = 0.3397                                         min =          1
     Between = 0.5574                                         avg =        7.8
     Overall = 0.4110                                         max =         17

                                                Wald chi2(16)     =   34935.12
corr(u_i, X) = 0 (assumed)                      Prob > chi2       =     0.0000

-----------------------------------------------------------------------------------------------
                   log_income | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
------------------------------+----------------------------------------------------------------
                  child_birth |
     Childbirth in past year  |  -.3430838   .0321488   -10.67   0.000    -.4060943   -.2800733
                              |
                         male |
                        Male  |    .501164   .0185754    26.98   0.000     .4647568    .5375712
                              |
             child_birth#male |
Childbirth in past year#Male  |    .401058   .0371436    10.80   0.000     .3282578    .4738582
                              |
                          age |    .124472   .0017029    73.10   0.000     .1211345    .1278096
                              |
                      mstatus |
                     Married  |   .4500031   .0221118    20.35   0.000     .4066648    .4933415
       Separated or divorced  |  -.0631739   .0429759    -1.47   0.142    -.1474051    .0210574
                     Widowed  |  -.0722313   .2628985    -0.27   0.784     -.587503    .4430403
                              |
                    ethnicity |
                       Black  |  -.3797007   .0196056   -19.37   0.000     -.418127   -.3412744
                    Hispanic  |     -.0785   .0204811    -3.83   0.000    -.1186422   -.0383577
   Mixed Race (Non-Hispanic)  |  -.3047843   .0812326    -3.75   0.000    -.4639972   -.1455714
                              |
                      edyears |     .16195   .0039019    41.51   0.000     .1543024    .1695976
                     age_mean |   .0024372   .0052386     0.47   0.642    -.0078302    .0127047
                 mstatus_mean |   .2064446     .03475     5.94   0.000     .1383359    .2745533
             child_birth_mean |   .0040493   .0611608     0.07   0.947    -.1158236    .1239222
                 edyears_mean |  -.0286279   .0063945    -4.48   0.000     -.041161   -.0160948
                    male_mean |          0  (omitted)
               ethnicity_mean |          0  (omitted)
                      n_waves |   .0070167    .002806     2.50   0.012      .001517    .0125163
                        _cons |   3.108408   .0771751    40.28   0.000     2.957147    3.259668
------------------------------+----------------------------------------------------------------
                      sigma_u |  .44121779
                      sigma_e |  1.1753411
                          rho |  .12351574   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------------------

. 
. // save data
. save "$cleandata/childbirth_clean.dta", replace
file C:/Users/andres/repositories/am.as2/report/stata/data/clean/childbirth_clean.dta saved

. 
. // close log
. log close
      name:  <unnamed>
       log:  C:/Users/andres/repositories/am.as2/report/stata/output/logs/main.log
  log type:  text
 closed on:  30 Sep 2025, 13:32:26
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
